УТ_для_edt.РасширениеСмарт/src/Documents/ЗаявкаНаРасходованиеДенежныхСредств/ЗаявкаНаРасходованиеДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КтоЗаявил</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8d0c39e-e0f3-4ec3-82b4-e50b2711f842">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="36cb4838-c436-4bf0-9c71-bb079fed4041">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="e9f9e8b4-0ef2-4893-a052-aed6ee5182e3">
    <name>смартОшибкиВРеквизитах</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e263d115-ae34-4efe-a483-b809d8ed54ee">
      <name>СинонимРеквизита</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ccf91d05-c2b0-4cf8-b0df-9d0f0962dcd8">
      <name>ОписаниеОшибки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="cbfe7c8f-54c1-43a8-ad59-1e976148c661">
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="730b12c8-52ae-454d-9a3d-98ac29a5bcf3">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ВнутренняяПередачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="51ad2381-0d1f-4a17-823e-32dfa2be2232">
    <name>ВозвратДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПодотчетника</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНедопоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленнойЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратНеперечисленныхДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратОтРозничногоПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b9173f63-0738-4171-948a-e90e1e33ba23">
    <name>ВозвратОтХранителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5407710e-c387-4626-8b05-5211234aa07e">
    <name>ВозвратТоваровКомитенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="34640f68-5c62-4ba4-9701-91967a54a881">
    <name>ВозвратТоваровПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ce981ba1-51f7-44d0-99db-29d24af3a802">
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="c7a92b86-d4b7-444e-b574-99f2caed6111">
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="95818758-8542-4405-8773-6b644d757e22">
    <name>ВыдачаДенежныхСредствПодотчетнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6915db6f-cc8d-4766-aca9-84cf48edcd58">
    <name>ВыдачаЗаймаСотруднику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b5771beb-5568-450d-963a-bfe9090b7f8c">
    <name>ВыдачаЗаймов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6d079ef6-b405-487d-9ff8-d6cbe795713f">
    <name>ВыплатаЗарплатыНаЛицевыеСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b4199927-65e9-4e54-90f9-456e4c68a93f">
    <name>ВыплатаЗарплатыПоЗарплатномуПроекту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="883d636d-f604-43b6-9d3c-4aa11be20085">
    <name>ВыплатаЗарплатыРаботнику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="987c15be-84c5-4923-a839-5533e7ab4c5c">
    <name>ВыплатаЗарплатыРаздатчиком</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="240b34c3-b18a-47c5-9f2f-bd241e23e42a">
    <name>ВыплатаЗарплатыЧерезКассу</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаВСтранахЕАЭСФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпорту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаПоИмпортуТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаТоварыВПути</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщикаФактуровкаПоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="5378e85b-b5ef-4819-816d-7cff3ed3291f">
    <name>ИнкассацияДенежныхСредствВБанк</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИнкассацияДенежныхСредствИзБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИсправлениеОшибок</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>КорректировкаПоСогласованиюСторон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="692215c8-f484-4e22-b24f-430cd2009fae">
    <name>ОплатаДенежныхСредствВДругуюОрганизацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="15ce947b-5b8c-4087-b372-2f3f60dedd76">
    <name>ОплатаЛизингодателю</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2d869152-e27f-4d56-a690-de6ac662ace2">
    <name>ОплатаПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1923f574-7981-46df-b96d-b293c2f88d8c">
    <name>ОплатаПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОформлениеГТДБрокером</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОформлениеГТДСамостоятельно</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="af539695-7bf1-4480-85fa-d029bcbfda95">
    <name>ПередачаНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваровМеждуФилиалами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПереоценкаРасчетовСКлиентами</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1e18177a-fe02-4999-a369-fb008fe9fd42">
    <name>ПеречислениеВБюджет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаДругойСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="572c15b7-b781-43a9-91fb-eecc7ecffee8">
    <name>ПеречислениеНаДепозиты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1879ad4f-47e1-438b-9738-f1429bc3c780">
    <name>ПеречислениеТаможне</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПогашениеЗаймаСотрудником</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзБанка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыНаРасчетныйСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоДепозитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоЗаймамВыданным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствПоКредитам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСДругогоСчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыПоПлатежнойКарте</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПриемНаХранениеСПравомПродажи</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="693adf02-fccb-4cd9-a092-f9fa532b7983">
    <name>ПрочаяВыдачаДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ad2322ce-9ed5-4e79-ace7-6f03b97d9445">
    <name>РазборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияБезПереходаПраваСобственности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиентуРеглУчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>РеализацияПерепоставленногоТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f675a52b-940a-480e-8374-c64ff49e4478">
    <name>СборкаТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8ed431c8-e520-4853-99da-e30f78c67d3c">
    <name>СдачаДенежныхСредствВБанк</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ae5b97e9-6e3e-40da-af52-695ba210a200">
    <name>СписаниеДебиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="733cca42-63ac-4b08-87d9-90abec9c03ec">
    <name>СписаниеКредиторскойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82e6dbf8-d7ba-4382-9880-9e83d175a158">
    <name>СписаниеТоваровПоТребованию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Documents/ЗаявкаНаРасходованиеДенежныхСредств/Forms/ФормаДокумента/Module.bsl
//++ смарт:ПА #815 10.12.2021 19:54:18
&После("СтатусПриИзменении")
&НаКлиенте
Процедура смарт_СтатусПриИзмененииПосле(Элемент)
    
    //ЭтоБухгалтер=ПроверкаБухгалтер();
    Если НЕ ПользователиКлиент.ТекущийПользователь()=Объект.КтоЗаявил И Объект.Статус=ПредопределенноеЗначение("Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена") Тогда //ЭтоБухгалтер И 
        
        Объект.КтоРешил = ПользователиКлиент.ТекущийПользователь();
        СС = Новый Структура;
        СС.Вставить("Ключ", Объект.Ссылка);
        СС.Вставить("ТолькоПросмотр", Ложь);
        Оповещение = Новый ОписаниеОповещения("смартСохранениеОшибок", ЭтотОбъект);
        ОткрытьФорму("Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.смарт_ФормаОшибок", СС,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

    КонецЕсли; 

КонецПроцедуры //-- смарт:ПА #815 10.12.2021 19:54:18

//++ смарт:ПА #815 10.12.2021 21:02:45
&НаКлиенте
Процедура смартСохранениеОшибок(Результат, ДополнительныеПараметры) Экспорт
    
    Если Результат <> Неопределено Тогда 
        Объект.смартОшибкиВРеквизитах.Очистить();
        Для каждого Стр Из Результат Цикл
            НСтрока=Объект.смартОшибкиВРеквизитах.Добавить();    
            ЗаполнитьЗначенияСвойств(НСтрока,Стр);
        КонецЦикла; 
    КонецЕсли;
    
КонецПроцедуры //-- смарт:ПА #815 10.12.2021 21:02:45

//++ смарт:ПА #815 11.12.2021 19:30:37
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
    
    Если Объект.Статус=Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена И ПараметрыСеанса.ТекущийПользователь=Объект.КтоЗаявил Тогда
        
        НоваяКоманда = ЭтаФорма.Команды.Добавить("Ошибки");
        НоваяКоманда.Действие = "ОткрытьОкноСОшибками";//Имя процедуры
        НоваяКоманда.Заголовок = "Ошибки заполнения";
        //Создаем Кнопку в конце Родителя (формы)
        НоваяКнопка = ЭтаФорма.Элементы.Вставить("ОткрытьОкноСОшибками", Тип("КнопкаФормы"), Элементы.ГруппаСтатусПриоритет, Элементы.Приоритет);// 
        НоваяКнопка.ИмяКоманды = "Ошибки";
        НоваяКнопка.Вид = ВидКнопкиФормы.Гиперссылка;
        НоваяКнопка.ЦветТекста = WebЦвета.ОранжевоКрасный;
        
        НовыйЭлемент = ЭтаФорма.Элементы.Вставить("смартКтоРешил", Тип("ДекорацияФормы"),Элементы.ГруппаСтатусПриоритет, );//, Элементы.Приоритет
        НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
        НовыйЭлемент.Заголовок = "Отклонил(а): "+ФизическиеЛицаУТ.ФамилияИнициалыФизЛица(Объект.КтоРешил.ФизическоеЛицо);
        НовыйЭлемент.ЦветТекста = WebЦвета.ОранжевоКрасный;
        
        Если Объект.смартОшибкиВРеквизитах.Количество() Тогда
            Для каждого Эл Из Объект.смартОшибкиВРеквизитах Цикл
                //Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств.Синоним
                Если ЗначениеЗаполнено(Эл.ОписаниеОшибки) Тогда
                    Для каждого ЭлФормы Из Элементы Цикл
                        Если ЭлФормы.Имя = Эл.СинонимРеквизита Тогда
                            Если Элементы[ЭлФормы.Имя].Вид=ВидГруппыФормы.Страница Тогда
                                Элементы[ЭлФормы.Имя].Картинка=БиблиотекаКартинок.ВниманиеКрасный;
                                
                                Продолжить;
                            КонецЕсли; 
                            Элементы[ЭлФормы.Имя].ЦветТекстаЗаголовка=WebЦвета.ОранжевоКрасный;
                            Элементы[ЭлФормы.Имя].Подсказка="ОписаниеОшибки: " +Эл.ОписаниеОшибки;
                        КонецЕсли; 
                    КонецЦикла; 
                КонецЕсли; 
            КонецЦикла; 
        КонецЕсли;      
    КонецЕсли; 

КонецПроцедуры //-- смарт:ПА #815 11.12.2021 19:30:37

//++ смарт:ПА #815 11.12.2021 19:35:32
&НаКлиенте
Процедура ОткрытьОкноСОшибками()
    
    СС = Новый Структура;
    СС.Вставить("Ключ", Объект.Ссылка);
    СС.Вставить("ТолькоПросмотр", Истина);
    Оповещение = Новый ОписаниеОповещения("смартСохранениеОшибок", ЭтотОбъект);
    ОткрытьФорму("Документ.ЗаявкаНаРасходованиеДенежныхСредств.Форма.смарт_ФормаОшибок", СС,ЭтаФорма,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры //-- смарт:ПА #815 11.12.2021 19:35:32

//++ смарт:ПА #815 24.12.2021 19:35:32
&НаКлиенте
Процедура смарт_ЖелательнаяДатаПлатежаПриИзмененииПосле(Элемент)
    смарт_ЖелательнаяДатаПлатежаПриИзмененииПослеНаСервере();
КонецПроцедуры //-- смарт:ПА #815 24.12.2021 19:35:32

//++ смарт:ПА #815 24.12.2021 19:35:32
&НаСервере
Процедура смарт_ЖелательнаяДатаПлатежаПриИзмененииПослеНаСервере()
    ДобавитьИзменитьСтрокуТЧРаспределениеПоСчетам();
КонецПроцедуры //-- смарт:ПА #815 24.12.2021 19:35:32

&НаСервере
&После("ЗаполнитьРеквизитыДокументаПоФормеОплаты")
Процедура смарт_ЗаполнитьРеквизитыДокументаПоФормеОплаты()
		
	//++ смарт:Подкин #914 01.03.2022 17:24:46
	Объект.БанковскийСчет = Справочники.БанковскиеСчетаОрганизаций.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(
	Объект.Организация,
	Объект.Валюта);
	//-- смарт:Подкин #914 01.03.2022 17:24:46
    
    //++ смарт:ПА #815 24.12.2021 19:35:32
	ДобавитьИзменитьСтрокуТЧРаспределениеПоСчетам();
	//-- смарт:ПА #815 24.12.2021 19:35:32

КонецПроцедуры 

//++ смарт:ПА #815 24.12.2021 19:35:32
&НаКлиенте
Процедура смарт_СуммаДокументаПриИзмененииПосле(Элемент)
	
	ДобавитьИзменитьСтрокуТЧРаспределениеПоСчетам();
	
	//++ #Б-4832 смарт: Фролов 06.11.2025 //Доработка документа Заявка на расход ДС.
	смартОпределитьБанковскийСчетОрганизации(); 
	//-- #Б-4832 смарт: Фролов 06.11.2025
	
КонецПроцедуры //-- смарт:ПА #815 24.12.2021 19:35:32

//++ смарт:ПА #815 24.12.2021 19:35:32
&НаСервере
Процедура ДобавитьИзменитьСтрокуТЧРаспределениеПоСчетам()
    //Банковский счет
    //СуммаПлатежа
    //ВалютаПлатежа    
    Если Объект.РаспределениеПоСчетам.Количество()>0 Тогда
        
        Для каждого Стр Из Объект.РаспределениеПоСчетам Цикл
            
            Стр.БанковскийСчетКасса = Объект.БанковскийСчет;
            Стр.Сумма = Объект.СуммаДокумента;
            Стр.ДатаПлатежа = Объект.ЖелательнаяДатаПлатежа;
            
        КонецЦикла;   
        
    Иначе
        
        НоваяСтрока=Объект.РаспределениеПоСчетам.Добавить();  
        НоваяСтрока.БанковскийСчетКасса = Объект.БанковскийСчет;
        НоваяСтрока.Сумма = Объект.СуммаДокумента;
        НоваяСтрока.ДатаПлатежа = Объект.ЖелательнаяДатаПлатежа;
        
    КонецЕсли;
    
КонецПроцедуры //-- смарт:ПА #815 24.12.2021 19:35:32

//++ смарт:Подкин #815 15.03.2022 17:13:51
&НаКлиенте
Процедура смарт_БанковскийСчетПриИзмененииПосле(Элемент)
    ДобавитьИзменитьСтрокуТЧРаспределениеПоСчетам();
КонецПроцедуры
//-- смарт:Подкин #815 15.03.2022 17:13:51

#Область ПеренесеноСДоработками

&НаСервере
Процедура смарт_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	
	//++#1307 смарт: Лопато 07.02.2023 //Запретить контактных лиц на "неопределенном партнере"
	Если Объект.Контрагент.Партнер = Справочники.Партнеры.НеизвестныйПартнер Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Запрещено оформлять документы по контрагентам с неопределенным партнером!'"), 
														  , "Контрагент", "Объект.Контрагент", Отказ);
	КонецЕсли;
	
	Для каждого СтрокаРасшифровкаПлатежа Из Объект.РасшифровкаПлатежа Цикл
		Если СтрокаРасшифровкаПлатежа.Партнер = Справочники.Партнеры.НеизвестныйПартнер Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Запрещено оформлять документы по неопределенным партнерам!'"), ,
				?(ЭтаФорма.ПереключательРасшифровки = 0, "РасшифровкаБезРазбиенияПартнер", "Элементы.РасшифровкаПлатежа.Партнер"),
				"Элементы.РасшифровкаПлатежа.ТекущиеДанные.Партнер",
				Отказ);
		КонецЕсли;
	КонецЦикла;
	//--#1307 смарт: Лопато 07.02.2023
	
КонецПроцедуры

&НаКлиенте
&После("ДатаПриИзменении")
Процедура смарт_ДатаПриИзмененииПосле(Элемент)
	//++#1308 смарт: Лопато 08.02.2023 //Новый вид налогового платежа «Единый налоговый платеж» из УТ 11.5.10.93 - Не переносить в новую конфигурацию!  	
	УстановитьПараметрыВыбораТипаНалогов();
	//--#1308 смарт: Лопато 08.02.2023 - из УТ 11.5.10.93 - Не переносить в новую конфигурацию!
КонецПроцедуры 

&НаСервере
&После("ХозяйственнаяОперацияПриИзмененииСервер")
Процедура смарт_ХозяйственнаяОперацияПриИзмененииСерверПосле()
	//++#1308 смарт: Лопато 08.02.2023 //Новый вид налогового платежа «Единый налоговый платеж» из УТ 11.5.10.93 - Не переносить в новую конфигурацию!  
	УстановитьПараметрыВыбораТипаНалогов();
	//--#1308 смарт: Лопато 08.02.2023 - из УТ 11.5.10.93 - Не переносить в новую конфигурацию!
	
	//++ #Б-2610 смарт: Лопато 07.03.2025 //Поля для приказа на выплату ДС подотчетнику в заявке на расходование ДС сделать только для одной операции.  
	Если ЭтаФорма.Элементы.Найти("смартГруппаПриказНаВыплатуДСПодотчетнику") <> Неопределено Тогда

		ЭтаФорма.Элементы.смартГруппаПриказНаВыплатуДСПодотчетнику.Видимость 
			= Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику;
			
	КонецЕсли;	
	//-- #Б-2610 смарт: Лопато 07.03.2025
	
КонецПроцедуры 

&НаСервере
&После("ОрганизацияПриИзмененииСервер")
Процедура смарт_ОрганизацияПриИзмененииСерверПосле()
	//++#1308 смарт: Лопато 08.02.2023 //Новый вид налогового платежа «Единый налоговый платеж» из УТ 11.5.10.93 - Не переносить в новую конфигурацию!  
	УстановитьПараметрыВыбораТипаНалогов();
	//--#1308 смарт: Лопато 08.02.2023 - из УТ 11.5.10.93 - Не переносить в новую конфигурацию!
	
	//++#1400 смарт: Лопато 19.07.2023 //Счет по умолчанию в Заявке на расход ДС  
	ДобавитьИзменитьСтрокуТЧРаспределениеПоСчетам();
	//--#1400 смарт: Лопато 19.07.2023
	
КонецПроцедуры 

&НаСервере
&После("ПриЧтенииСозданииНаСервере")
Процедура смарт_ПриЧтенииСозданииНаСервереПосле()
	//++#1308 смарт: Лопато 08.02.2023 //Новый вид налогового платежа «Единый налоговый платеж» из УТ 11.5.10.93 - Не переносить в новую конфигурацию!  
	ПроверитьКорректностьЗаполненияПлатежаВБюджет();
	УстановитьПараметрыВыбораТипаНалогов();
	//--#1308 смарт: Лопато 08.02.2023 - из УТ 11.5.10.93 - Не переносить в новую конфигурацию!
КонецПроцедуры 

&НаСервере
&После("ТипНалогаПриИзмененииНаСервере")
Процедура смарт_ТипНалогаПриИзмененииНаСервереПосле()
	//++#1308 смарт: Лопато 08.02.2023 //Новый вид налогового платежа «Единый налоговый платеж» из УТ 11.5.10.93 - Не переносить в новую конфигурацию!  
	ПроверитьКорректностьЗаполненияПлатежаВБюджет();
	//--#1308 смарт: Лопато 08.02.2023 - из УТ 11.5.10.93 - Не переносить в новую конфигурацию!
КонецПроцедуры 

&НаСервере
&После("КонтрагентПриИзмененииСервер")
Процедура смарт_КонтрагентПриИзмененииСерверПосле()
	//++#1308 смарт: Лопато 08.02.2023 //Новый вид налогового платежа «Единый налоговый платеж» из УТ 11.5.10.93 - Не переносить в новую конфигурацию!  
	ПроверитьКорректностьЗаполненияПлатежаВБюджет();
	//--#1308 смарт: Лопато 08.02.2023 - из УТ 11.5.10.93 - Не переносить в новую конфигурацию!
КонецПроцедуры 

&НаСервере
&После("БанковскийСчетКонтрагентаПриИзмененииНаСервере")
Процедура смарт_БанковскийСчетКонтрагентаПриИзмененииНаСервереПосле()
	//++#1308 смарт: Лопато 08.02.2023 //Новый вид налогового платежа «Единый налоговый платеж» из УТ 11.5.10.93 - Не переносить в новую конфигурацию!  
	ПроверитьКорректностьЗаполненияПлатежаВБюджет();
	//--#1308 смарт: Лопато 08.02.2023 - из УТ 11.5.10.93 - Не переносить в новую конфигурацию!
	
	//++ #Б-4832 смарт: Фролов 06.11.2025 //Доработка документа Заявка на расход ДС.
	смартОпределитьБанковскийСчетОрганизации(); 
	//-- #Б-4832 смарт: Фролов 06.11.2025
	
КонецПроцедуры 

&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
//++ #Б-4832 смарт: Фролов 06.11.2025 //Доработка документа Заявка на расход ДС.
Процедура смарт_ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда

		ФинансыКлиент.ПроверитьЗаполнениеДокументаНаОсновании(Объект, Основание);

		ТекущаяДата = Объект.Дата;
		ПрименениеПриказа107н = Объект.Дата >= ДатаНачалаПримененияПриказа107н;

		Если ПериодАвансовогоОтчета = "Через неделю" Тогда
			Объект.ДатаАвансовогоОтчета = ?(ЗначениеЗаполнено(Объект.ДатаПлатежа), Объект.ДатаПлатежа, ТекущаяДата()) + 7 * 24 * 3600;
		КонецЕсли;
		
		#Вставка
		//++ #Б-4832 смарт: Фролов 27.10.2025 //Доработка документа Заявка на расход ДС.
		ФормаОплаты = "Безналичная";
		ФормаОплатыПриИзменении(Элементы.ФормаОплаты);
		смартОпределитьБанковскийСчетОрганизации();
		//-- #Б-4832 смарт: Фролов 27.10.2025
		#КонецВставки
		
	КонецЕсли;

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// ИнтернетПоддержкаПользователей.СПАРКРиски, ПриОткрытии.
	СПАРКРискиКлиент.ПриОткрытии(ЭтотОбъект, Неопределено);
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски, ПриОткрытии.

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#Вставка
	//++ #6790 смарт: Тимофеева 29.05.2026 / Заявки на расходование денежных средств в валюте. Курс.
	Если НЕ НадписьФактическаяОплата = Новый ФорматированнаяСтрока("Оплачена полностью")
		И Объект.Валюта = ВалютаРеглУчета 
		И Объект.РасшифровкаПлатежа.Количество() > 0 Тогда
		ТребуетсяКонтрольСуммы = Ложь;
		
		Для Каждого ТекущаяСтрока Из Объект.РасшифровкаПлатежа Цикл 
			Если ЗначениеЗаполнено(ТекущаяСтрока.ВалютаВзаиморасчетов) И НЕ ТекущаяСтрока.ВалютаВзаиморасчетов = ВалютаРеглУчета Тогда
				ТребуетсяКонтрольСуммы = Истина;
			КонецЕсли;			
		КонецЦикла;
		
		Если ТребуетсяКонтрольСуммы Тогда 		
			РезультатРасчетаСумм = РассчитатьСуммыВВалютеДокумента();
			 
			Если НЕ Объект.СуммаДокумента = РезультатРасчетаСумм.СуммаВВалютеДокумента Тогда			
				ПоказатьВопрос(Новый ОписаниеОповещения("ИзменитьСуммуДокументаЗавершение", ЭтотОбъект, РезультатРасчетаСумм),
						СтрШаблон("Внимание! На текущую дату сумма документа требует корректировки согласно новому курсу валюты взаиморасчетов %1 -> %2. Изменить сумму документа?", Объект.СуммаДокумента, РезультатРасчетаСумм.СуммаВВалютеДокумента),
						РежимДиалогаВопрос.ДаНет);			
			КонецЕсли;		
		КонецЕсли;
    КонецЕсли;
	//-- #6790 смарт: Тимофеева 29.05.2026
	#КонецВставки
КонецПроцедуры //-- #Б-4832 смарт: Фролов 06.11.2025

//++ #6790 смарт: Тимофеева 29.05.2026 / Заявки на расходование денежных средств в валюте. Курс.
&НаСервере
Функция РассчитатьСуммыВВалютеДокумента()
	Результат = Новый Структура("СуммаВВалютеДокумента, СуммыРасшифровки", 0, Новый Соответствие);
	
	КурсИКратностьРегл = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРеглУчета, ТекущаяДатаСеанса());
	ПараметрыВалютыРегл = Новый Структура("Курс, Кратность, Валюта", КурсИКратностьРегл.Курс, КурсИКратностьРегл.Кратность, ВалютаРеглУчета);
	
	Для Каждого ТекущаяСтрока Из Объект.РасшифровкаПлатежа Цикл 
		Если ЗначениеЗаполнено(ТекущаяСтрока.ВалютаВзаиморасчетов) 
			И НЕ ТекущаяСтрока.ВалютаВзаиморасчетов = ВалютаРеглУчета Тогда
			КурсИКратностьТек = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ТекущаяСтрока.ВалютаВзаиморасчетов, ТекущаяДатаСеанса());
			ПараметрыТекВалюты = Новый Структура("Курс, Кратность, Валюта", КурсИКратностьТек.Курс, КурсИКратностьТек.Кратность, ТекущаяСтрока.ВалютаВзаиморасчетов);
			ТекущаяСтрокаСумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ТекущаяСтрока.СуммаВзаиморасчетов, ПараметрыТекВалюты, ПараметрыВалютыРегл);
			
			Результат.СуммаВВалютеДокумента = Результат.СуммаВВалютеДокумента + ТекущаяСтрокаСумма;
			Результат.СуммыРасшифровки.Вставить(ТекущаяСтрока.НомерСтроки, ТекущаяСтрокаСумма); 
		Иначе
			Результат.СуммаВВалютеДокумента = Результат.СуммаВВалютеДокумента + ТекущаяСтрока.СуммаВзаиморасчетов;
			Результат.СуммыРасшифровки.Вставить(ТекущаяСтрока.НомерСтроки, ТекущаяСтрока.СуммаВзаиморасчетов);
		КонецЕсли;		
	КонецЦикла; 
	Результат.СуммаВВалютеДокумента = Окр(Результат.СуммаВВалютеДокумента, 2);
	Возврат Результат;	
КонецФункции          

&НаКлиенте
Процедура ИзменитьСуммуДокументаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		//++ #7252 смарт: Тимофеева 01.07.2026 / Дополнение при изменении суммы оплаты в Заявке на расход ДС 
		СуммаДокументаДоИзменения = Объект.СуммаДокумента;
		СуммаНДСДоИзменения 	  = Объект.РасшифровкаПлатежа.Итог("СуммаНДС");
		//++ #7252 смарт: Тимофеева 01.07.2026
		
		Объект.СуммаДокумента = ДополнительныеПараметры.СуммаВВалютеДокумента;		
		Для Каждого ТекущаяСтрока Из Объект.РасшифровкаПлатежа Цикл 
	    	ТекущаяСтрока.Сумма = ДополнительныеПараметры.СуммыРасшифровки.Получить(ТекущаяСтрока.НомерСтроки); 
		КонецЦикла;
		СуммаДокументаПриИзмененииСервер();
		
		Объект.РаспределениеПоСчетам.Очистить();
		СтрРаспределениеПоСчетам 						= Объект.РаспределениеПоСчетам.Добавить();
		СтрРаспределениеПоСчетам.БанковскийСчетКасса 	= Объект.БанковскийСчет;
		СтрРаспределениеПоСчетам.ДатаПлатежа 			= Объект.ДатаПлатежа;
		СтрРаспределениеПоСчетам.Сумма 					= Объект.СуммаДокумента; 
		
		//++ #7252 смарт: Тимофеева 01.07.2026 / Дополнение при изменении суммы оплаты в Заявке на расход ДС 
		Модифицированность = Истина; 
		
		Если ЗначениеЗаполнено(Объект.НазначениеПлатежа) Тогда 
			ФорматнаяСтрока = "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=";
			СуммаДокументаДоИзмененияСтрокой = Формат(СуммаДокументаДоИзменения, ФорматнаяСтрока);
			Если СтрНайти(Объект.НазначениеПлатежа, СуммаДокументаДоИзмененияСтрокой) > 0 Тогда  
				Объект.НазначениеПлатежа = СтрЗаменить(Объект.НазначениеПлатежа, СуммаДокументаДоИзмененияСтрокой, Формат(Объект.СуммаДокумента, ФорматнаяСтрока));	
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Не удалось скорректировать назначение платежа. Не найдена сумма до изменения ""%1""", СуммаДокументаДоИзмененияСтрокой));
			КонецЕсли;  
			
			СуммаНДСДоИзмененияСтрокой = Формат(СуммаНДСДоИзменения, ФорматнаяСтрока);
			Если СтрНайти(Объект.НазначениеПлатежа, СуммаНДСДоИзмененияСтрокой) > 0 Тогда  
				Объект.НазначениеПлатежа = СтрЗаменить(Объект.НазначениеПлатежа, СуммаНДСДоИзмененияСтрокой, Формат(Объект.РасшифровкаПлатежа.Итог("СуммаНДС"), ФорматнаяСтрока));	
			Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Не удалось скорректировать назначение платежа. Не найдена сумма НДС до изменения ""%1""", СуммаНДСДоИзмененияСтрокой));
			КонецЕсли;
		КонецЕсли; 	
		//++ #7252 смарт: Тимофеева 01.07.2026
	КонецЕсли;	
КонецПроцедуры
//-- #6790 смарт: Тимофеева 29.05.2026

&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
//++ #Б-4990 смарт: Фролов 17.11.2025 //Доработка обработки "Управление финансовыми потоками" 
Процедура смарт_ПослеЗаписи(ПараметрыЗаписи)

	НастроитьЗависимыеЭлементыФормы("Модифицированность");

	// Используется для автоматического обновления формы платежного календаря
	Оповестить("Запись_ЗаявкаНаРасходованиеДенежныхСредств", ПараметрыЗаписи, Объект.Ссылка);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ОповеститьОбИзмененииТекущихДелПоЭДО();

	ОбменСКонтрагентамиКлиент.ПослеЗаписи_ФормаДокумента(ЭтаФорма, ПараметрыЗаписи);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	
	#Вставка 
	//++ #Б-4990 смарт: Фролов 17.11.2025 //Доработка обработки "Управление финансовыми потоками" 
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Оповестить("ПроведенаНоваяЗаявкаНаРасходИлиПереводДС", , ЭтаФорма); 
		
	КонецЕсли;	
	//-- #Б-4990 смарт: Фролов 17.11.2025
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти

#Область ДоработкиСмарт

//++#1308 смарт: Лопато 08.02.2023 //Новый вид налогового платежа «Единый налоговый платеж» из УТ 11.5.10.93 - Не переносить в новую конфигурацию!  
&НаСервере
Процедура УстановитьПараметрыВыбораТипаНалогов()
	
	ТекущаяДата = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	Если НЕ ПлатежиВБюджет.ИспользуетсяЕдиныйНалоговыйПлатеж(Объект.Организация, ТекущаяДата) Тогда
		Возврат;
	КонецЕсли;
	
	ДоступныеТипыНалогов = Новый Массив;
	ДоступныеТипыНалогов.Добавить(Перечисления.ТипыНалогов.ПрочиеНалогиИСборы);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДоступныеТипыНалогов, ПлатежиВБюджет.ТипыНалоговУплачиваемыеОтдельно());
	
	ПараметрыВыбораНалогов = Новый Массив;
	ПараметрыВыбораНалогов.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", ДоступныеТипыНалогов));
	Элементы.ТипНалога.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораНалогов);
	
КонецПроцедуры //--#1308 смарт: Лопато 08.02.2023 - из УТ 11.5.10.93 - Не переносить в новую конфигурацию!

//++#1308 смарт: Лопато 08.02.2023 //Новый вид налогового платежа «Единый налоговый платеж» из УТ 11.5.10.93 - Не переносить в новую конфигурацию!  
&НаСервере
Процедура ПроверитьКорректностьЗаполненияПлатежаВБюджет()
	
	ТекущаяДата = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());
	ПлатежиВБюджет.ПроверитьКорректностьЗаполненияПлатежаВБюджет(ЭтотОбъект, ТекущаяДата);
	
КонецПроцедуры //--#1308 смарт: Лопато 08.02.2023 - из УТ 11.5.10.93 - Не переносить в новую конфигурацию!

//++ #1712 смарт: Мосолов 20.09.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ЗаявкаНаРасходованиеДенежныхСредств
&НаСервере
&ИзменениеИКонтроль("ЗаполнитьСписокКодовВидаДохода")
Процедура смарт_ЗаполнитьСписокКодовВидаДохода()

	Элементы.КодВидаДохода.СписокВыбора.Очистить();  
	
	#Удаление
	Для каждого ЭлементСписка Из ПлатежиВБюджетКлиентСервер.КодыВидовДохода(
	#КонецУдаления
	
	#Вставка
	//++#1332 смарт: Лопато 27.03.2023 //Изменения кодов для перечисления по исполнительным листам
	ТекущаяДата = ?(ЗначениеЗаполнено(Объект.Дата), Объект.Дата, ТекущаяДатаСеанса());  
	
	//++ #1571 смарт: Мосолов 11.12.2023 //Рефакторинг. Вызов переадресован на ПлатежиВБюджетКлиентСервер.смарт_КодыВидовДохода_Расширенная
	//Для каждого ЭлементСписка Из ПлатежиВБюджетКлиентСервер.КодыВидовДохода(ТекущаяДата,
	Для каждого ЭлементСписка Из ПлатежиВБюджетКлиентСервер.смарт_КодыВидовДохода_Расширенная(ТекущаяДата,
		//--#1571 смарт: Мосолов 11.12.2023	
		//--#1332 смарт: Лопато 27.03.2023	
	#КонецВставки
	
		Объект.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыПоЗарплатномуПроекту
		Или Объект.ХозяйственнаяОперацияПоЗарплате = Перечисления.ХозяйственныеОперации.ВыплатаЗарплатыНаЛицевыеСчета) Цикл
		Элементы.КодВидаДохода.СписокВыбора.Добавить(ЭлементСписка.Значение, ЭлементСписка.Представление);
	КонецЦикла;

КонецПроцедуры //-- #1712 смарт: Мосолов 20.09.2024

&НаСервере
//++ #Б-4832 смарт: Фролов 06.11.2025 //Доработка документа Заявка на расход ДС.
Процедура смартОпределитьБанковскийСчетОрганизации()
	
	СтруктураДанныхДокумента = Новый Структура;
	СтруктураДанныхДокумента.Вставить("Валюта", Объект.Валюта);
	СтруктураДанныхДокумента.Вставить("БанковскийСчетКонтрагента", Объект.БанковскийСчетКонтрагента);
	СтруктураДанныхДокумента.Вставить("СуммаДокумента", Объект.СуммаДокумента);
	СтруктураДанныхДокумента.Вставить("Банк", Объект.БанковскийСчетКонтрагента.Банк);
	СтруктураДанныхДокумента.Вставить("Контрагент", Объект.Контрагент);
	СтруктураДанныхДокумента.Вставить("Организация", Объект.Организация);
	
	//++ #Б-5408 смарт: Фролов 19.01.2026 //Доработка правил данных финансовых потоков.
	СтруктураДанныхДокумента.Вставить("Автор", Объект.Автор);
	СтруктураДанныхДокумента.Вставить("КтоЗаявил", Объект.КтоЗаявил);
	СтруктураДанныхДокумента.Вставить("ХозяйственнаяОперация", Объект.ХозяйственнаяОперация);
	СтруктураДанныхДокумента.Вставить("ХозяйственнаяОперацияПоЗарплате", Объект.ХозяйственнаяОперацияПоЗарплате);
	//-- #Б-5408 смарт: Фролов 19.01.2026
	
	ОпределенныйБанковскийСчет = Справочники.смартПравилаДанныхФинансовыхПотоков.ПолучитьДанныеПоПравилам(СтруктураДанныхДокумента);
	
	Если ЗначениеЗаполнено(ОпределенныйБанковскийСчет) 
		И НЕ Объект.БанковскийСчет = ОпределенныйБанковскийСчет
		И ОпределенныйБанковскийСчет.Владелец = Объект.Организация Тогда
		
		Если ЗначениеЗаполнено(Объект.БанковскийСчет) Тогда
			
			ОбщегоНазначения.СообщитьПользователю("Банковский счет организации изменен.");
			
		КонецЕсли;	
		
		Объект.БанковскийСчет = ОпределенныйБанковскийСчет;
		
		//++ #Б-4976 смарт: Фролов 13.11.2025 //Доработка заполнения банковских счетов в Заявках на расходования ДС. 
		Объект.РаспределениеПоСчетам.Очистить();
		СтрРаспределениеПоСчетам = Объект.РаспределениеПоСчетам.Добавить();
		СтрРаспределениеПоСчетам.БанковскийСчетКасса = Объект.БанковскийСчет;
		СтрРаспределениеПоСчетам.ДатаПлатежа = Объект.ДатаПлатежа;
		СтрРаспределениеПоСчетам.Сумма = Объект.СуммаДокумента;
		//-- #Б-4976 смарт: Фролов 13.11.2025
		
	КонецЕсли;	
	
КонецПроцедуры	//-- #Б-4832 смарт: Фролов 06.11.2025

&НаКлиенте
&ИзменениеИКонтроль("ВалютаПриИзменении")
//++ #Б-4832 смарт: Фролов 06.11.2025 //Доработка документа Заявка на расход ДС.
Процедура смарт_ВалютаПриИзменении(Элемент)

	Если ТекущаяВалюта <> Объект.Валюта Тогда

		ВалютаПриИзмененииСервер();

		Объект.Касса = Неопределено;
		ФинансыКлиент.ОчиститьСуммуИВалютуВзаиморасчетовРасшифровкиПлатежа(Объект);
		ТекущаяВалюта = Объект.Валюта;

		ПересчитатьНДС();
	КонецЕсли;
	
	#Вставка
	//++ #Б-4832 смарт: Фролов 06.11.2025 //Доработка документа Заявка на расход ДС.
	смартОпределитьБанковскийСчетОрганизации(); 
	//-- #Б-4832 смарт: Фролов 06.11.2025
	#КонецВставки

КонецПроцедуры //-- #Б-4832 смарт: Фролов 06.11.2025

&НаКлиенте
&ИзменениеИКонтроль("КонтрагентПриИзменении")
//++ #Б-4832 смарт: Фролов 06.11.2025 //Доработка документа Заявка на расход ДС.
Процедура смарт_КонтрагентПриИзменении(Элемент)

	КонтрагентПриИзмененииСервер();

	// ИнтернетПоддержкаПользователей.СПАРКРиски, ОбновитьОтображениеИндексов.
	// Отображать не по ссылке, а по ИНН, НЕ сохраняя в кэше.
	ЭтотОбъект.ИндексыСПАРКРиски = Неопределено; // Сбросить полученные значения.
	ОбновитьОтображениеИндексыСПАРК();
	// Конец ИнтернетПоддержкаПользователей.СПАРКРиски, ОбновитьОтображениеИндексов.
	
	#Вставка
	//++ #Б-4832 смарт: Фролов 06.11.2025 //Доработка документа Заявка на расход ДС.
	смартОпределитьБанковскийСчетОрганизации(); 
	//-- #Б-4832 смарт: Фролов 06.11.2025
	#КонецВставки

КонецПроцедуры //-- #Б-4832 смарт: Фролов 06.11.2025

&НаКлиенте
&ИзменениеИКонтроль("ОрганизацияПриИзменении")
//++ #Б-4832 смарт: Фролов 07.11.2025 //Доработка документа Заявка на расход ДС.
Процедура смарт_ОрганизацияПриИзменении(Элемент)

	ОрганизацияПриИзмененииСервер();
	
	#Вставка
	//++ #Б-4832 смарт: Фролов 07.11.2025 //Доработка документа Заявка на расход ДС.
	смартОпределитьБанковскийСчетОрганизации(); 
	//-- #Б-4832 смарт: Фролов 07.11.2025
	#КонецВставки

КонецПроцедуры //-- #Б-4832 смарт: Фролов 07.11.2025

#КонецОбласти
